espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFM32PG22/Include/efm32pg22_smu.h
/* Bit fields for SMU PPUSATD1 */
#define _SMU_PPUSATD1_RESETVALUE              0x0000FFFFUL                              /**< Default value for SMU_PPUSATD1              */
#define _SMU_PPUSATD1_MASK                    0x0000FFFFUL                              /**< Mask for SMU_PPUSATD1                       */
#define SMU_PPUSATD1_DCDC                     (0x1UL << 1)                              /**< DCDC Secure Access                          */
#define _SMU_PPUSATD1_DCDC_SHIFT              1                                         /**< Shift value for SMU_DCDC                    */
#define _SMU_PPUSATD1_DCDC_MASK               0x2UL                                     /**< Bit mask for SMU_DCDC                       */
#define _SMU_PPUSATD1_DCDC_DEFAULT            0x00000001UL                              /**< Mode DEFAULT for SMU_PPUSATD1               */
#define SMU_PPUSATD1_DCDC_DEFAULT             (_SMU_PPUSATD1_DCDC_DEFAULT << 1)         /**< Shifted mode DEFAULT for SMU_PPUSATD1       */
#define SMU_PPUSATD1_PDM                      (0x1UL << 2)                              /**< PDM Secure Access                           */
#define _SMU_PPUSATD1_PDM_SHIFT               2                                         /**< Shift value for SMU_PDM                     */
#define _SMU_PPUSATD1_PDM_MASK                0x4UL                                     /**< Bit mask for SMU_PDM                        */
#define _SMU_PPUSATD1_PDM_DEFAULT             0x00000001UL                              /**< Mode DEFAULT for SMU_PPUSATD1               */
#define SMU_PPUSATD1_PDM_DEFAULT              (_SMU_PPUSATD1_PDM_DEFAULT << 2)          /**< Shifted mode DEFAULT for SMU_PPUSATD1       */
#define SMU_PPUSATD1_SMU                      (0x1UL << 5)                              /**< SMU Secure Access                           */
#define _SMU_PPUSATD1_SMU_SHIFT               5                                         /**< Shift value for SMU_SMU                     */
#define _SMU_PPUSATD1_SMU_MASK                0x20UL                                    /**< Bit mask for SMU_SMU                        */
#define _SMU_PPUSATD1_SMU_DEFAULT             0x00000001UL                              /**< Mode DEFAULT for SMU_PPUSATD1               */
#define SMU_PPUSATD1_SMU_DEFAULT              (_SMU_PPUSATD1_SMU_DEFAULT << 5)          /**< Shifted mode DEFAULT for SMU_PPUSATD1       */
#define SMU_PPUSATD1_SMUCFGNS                 (0x1UL << 6)                              /**< SMUCFGNS Secure Access                      */
#define _SMU_PPUSATD1_SMUCFGNS_SHIFT          6                                         /**< Shift value for SMU_SMUCFGNS                */
#define _SMU_PPUSATD1_SMUCFGNS_MASK           0x40UL                                    /**< Bit mask for SMU_SMUCFGNS                   */
#define _SMU_PPUSATD1_SMUCFGNS_DEFAULT        0x00000001UL                              /**< Mode DEFAULT for SMU_PPUSATD1               */
#define SMU_PPUSATD1_SMUCFGNS_DEFAULT         (_SMU_PPUSATD1_SMUCFGNS_DEFAULT << 6)     /**< Shifted mode DEFAULT for SMU_PPUSATD1       */
#define SMU_PPUSATD1_RTCC                     (0x1UL << 7)                              /**< RTCC Secure Access                          */
#define _SMU_PPUSATD1_RTCC_SHIFT              7                                         /**< Shift value for SMU_RTCC                    */
#define _SMU_PPUSATD1_RTCC_MASK               0x80UL                                    /**< Bit mask for SMU_RTCC                       */
#define _SMU_PPUSATD1_RTCC_DEFAULT            0x00000001UL                              /**< Mode DEFAULT for SMU_PPUSATD1               */
#define SMU_PPUSATD1_RTCC_DEFAULT             (_SMU_PPUSATD1_RTCC_DEFAULT << 7)         /**< Shifted mode DEFAULT for SMU_PPUSATD1       */
#define SMU_PPUSATD1_LETIMER0                 (0x1UL << 8)                              /**< LETIMER0 Secure Access                      */
#define _SMU_PPUSATD1_LETIMER0_SHIFT          8                                         /**< Shift value for SMU_LETIMER0                */
#define _SMU_PPUSATD1_LETIMER0_MASK           0x100UL                                   /**< Bit mask for SMU_LETIMER0                   */
#define _SMU_PPUSATD1_LETIMER0_DEFAULT        0x00000001UL                              /**< Mode DEFAULT for SMU_PPUSATD1               */
#define SMU_PPUSATD1_LETIMER0_DEFAULT         (_SMU_PPUSATD1_LETIMER0_DEFAULT << 8)     /**< Shifted mode DEFAULT for SMU_PPUSATD1       */
#define SMU_PPUSATD1_IADC0                    (0x1UL << 9)                              /**< IADC0 Secure Access                         */
#define _SMU_PPUSATD1_IADC0_SHIFT             9                                         /**< Shift value for SMU_IADC0                   */
#define _SMU_PPUSATD1_IADC0_MASK              0x200UL                                   /**< Bit mask for SMU_IADC0                      */
#define _SMU_PPUSATD1_IADC0_DEFAULT           0x00000001UL                              /**< Mode DEFAULT for SMU_PPUSATD1               */
#define SMU_PPUSATD1_IADC0_DEFAULT            (_SMU_PPUSATD1_IADC0_DEFAULT << 9)        /**< Shifted mode DEFAULT for SMU_PPUSATD1       */
#define SMU_PPUSATD1_I2C0                     (0x1UL << 10)                             /**< I2C0 Secure Access                          */
#define _SMU_PPUSATD1_I2C0_SHIFT              10                                        /**< Shift value for SMU_I2C0                    */
#define _SMU_PPUSATD1_I2C0_MASK               0x400UL                                   /**< Bit mask for SMU_I2C0                       */
#define _SMU_PPUSATD1_I2C0_DEFAULT            0x00000001UL                              /**< Mode DEFAULT for SMU_PPUSATD1               */
#define SMU_PPUSATD1_I2C0_DEFAULT             (_SMU_PPUSATD1_I2C0_DEFAULT << 10)        /**< Shifted mode DEFAULT for SMU_PPUSATD1       */
#define SMU_PPUSATD1_WDOG0                    (0x1UL << 11)                             /**< WDOG0 Secure Access                         */
#define _SMU_PPUSATD1_WDOG0_SHIFT             11                                        /**< Shift value for SMU_WDOG0                   */
#define _SMU_PPUSATD1_WDOG0_MASK              0x800UL                                   /**< Bit mask for SMU_WDOG0                      */
#define _SMU_PPUSATD1_WDOG0_DEFAULT           0x00000001UL                              /**< Mode DEFAULT for SMU_PPUSATD1               */
#define SMU_PPUSATD1_WDOG0_DEFAULT            (_SMU_PPUSATD1_WDOG0_DEFAULT << 11)       /**< Shifted mode DEFAULT for SMU_PPUSATD1       */
#define SMU_PPUSATD1_AMUXCP0                  (0x1UL << 12)                             /**< AMUXCP0 Secure Access                       */
#define _SMU_PPUSATD1_AMUXCP0_SHIFT           12                                        /**< Shift value for SMU_AMUXCP0                 */
#define _SMU_PPUSATD1_AMUXCP0_MASK            0x1000UL                                  /**< Bit mask for SMU_AMUXCP0                    */
#define _SMU_PPUSATD1_AMUXCP0_DEFAULT         0x00000001UL                              /**< Mode DEFAULT for SMU_PPUSATD1               */
#define SMU_PPUSATD1_AMUXCP0_DEFAULT          (_SMU_PPUSATD1_AMUXCP0_DEFAULT << 12)     /**< Shifted mode DEFAULT for SMU_PPUSATD1       */
#define SMU_PPUSATD1_EUART0                   (0x1UL << 13)                             /**< EUART0 Secure Access                        */
#define _SMU_PPUSATD1_EUART0_SHIFT            13                                        /**< Shift value for SMU_EUART0                  */
#define _SMU_PPUSATD1_EUART0_MASK             0x2000UL                                  /**< Bit mask for SMU_EUART0                     */
#define _SMU_PPUSATD1_EUART0_DEFAULT          0x00000001UL                              /**< Mode DEFAULT for SMU_PPUSATD1               */
#define SMU_PPUSATD1_EUART0_DEFAULT           (_SMU_PPUSATD1_EUART0_DEFAULT << 13)      /**< Shifted mode DEFAULT for SMU_PPUSATD1       */
#define SMU_PPUSATD1_CRYPTOACC                (0x1UL << 14)                             /**< CRYPTOACC Secure Access                     */
#define _SMU_PPUSATD1_CRYPTOACC_SHIFT         14                                        /**< Shift value for SMU_CRYPTOACC               */
#define _SMU_PPUSATD1_CRYPTOACC_MASK          0x4000UL                                  /**< Bit mask for SMU_CRYPTOACC                  */
#define _SMU_PPUSATD1_CRYPTOACC_DEFAULT       0x00000001UL                              /**< Mode DEFAULT for SMU_PPUSATD1               */
#define SMU_PPUSATD1_CRYPTOACC_DEFAULT        (_SMU_PPUSATD1_CRYPTOACC_DEFAULT << 14)   /**< Shifted mode DEFAULT for SMU_PPUSATD1       */

/* Bit fields for SMU PPUFS */
#define _SMU_PPUFS_RESETVALUE                 0x00000000UL                              /**< Default value for SMU_PPUFS                 */
#define _SMU_PPUFS_MASK                       0x000000FFUL                              /**< Mask for SMU_PPUFS                          */
#define _SMU_PPUFS_PPUFSPERIPHID_SHIFT        0                                         /**< Shift value for SMU_PPUFSPERIPHID           */
#define _SMU_PPUFS_PPUFSPERIPHID_MASK         0xFFUL                                    /**< Bit mask for SMU_PPUFSPERIPHID              */
#define _SMU_PPUFS_PPUFSPERIPHID_DEFAULT      0x00000000UL                              /**< Mode DEFAULT for SMU_PPUFS                  */
#define SMU_PPUFS_PPUFSPERIPHID_DEFAULT       (_SMU_PPUFS_PPUFSPERIPHID_DEFAULT << 0)   /**< Shifted mode DEFAULT for SMU_PPUFS          */

/* Bit fields for SMU BMPUPATD0 */
#define _SMU_BMPUPATD0_RESETVALUE             0x0000001FUL                              /**< Default value for SMU_BMPUPATD0             */
#define _SMU_BMPUPATD0_MASK                   0x0000001FUL                              /**< Mask for SMU_BMPUPATD0                      */
#define SMU_BMPUPATD0_CRYPTOACC               (0x1UL << 1)                              /**< CRYPTOACC DMA privileged mode               */
#define _SMU_BMPUPATD0_CRYPTOACC_SHIFT        1                                         /**< Shift value for SMU_CRYPTOACC               */
#define _SMU_BMPUPATD0_CRYPTOACC_MASK         0x2UL                                     /**< Bit mask for SMU_CRYPTOACC                  */
#define _SMU_BMPUPATD0_CRYPTOACC_DEFAULT      0x00000001UL                              /**< Mode DEFAULT for SMU_BMPUPATD0              */
#define SMU_BMPUPATD0_CRYPTOACC_DEFAULT       (_SMU_BMPUPATD0_CRYPTOACC_DEFAULT << 1)   /**< Shifted mode DEFAULT for SMU_BMPUPATD0      */
#define SMU_BMPUPATD0_LDMA                    (0x1UL << 4)                              /**< MCU LDMA privileged mode                    */
#define _SMU_BMPUPATD0_LDMA_SHIFT             4                                         /**< Shift value for SMU_LDMA                    */
#define _SMU_BMPUPATD0_LDMA_MASK              0x10UL                                    /**< Bit mask for SMU_LDMA                       */
#define _SMU_BMPUPATD0_LDMA_DEFAULT           0x00000001UL                              /**< Mode DEFAULT for SMU_BMPUPATD0              */
#define SMU_BMPUPATD0_LDMA_DEFAULT            (_SMU_BMPUPATD0_LDMA_DEFAULT << 4)        /**< Shifted mode DEFAULT for SMU_BMPUPATD0      */

/* Bit fields for SMU BMPUSATD0 */
#define _SMU_BMPUSATD0_RESETVALUE             0x0000001FUL                              /**< Default value for SMU_BMPUSATD0             */
#define _SMU_BMPUSATD0_MASK                   0x0000001FUL                              /**< Mask for SMU_BMPUSATD0                      */
#define SMU_BMPUSATD0_CRYPTOACC               (0x1UL << 1)                              /**< CRYPTOACC DMA secure mode                   */
#define _SMU_BMPUSATD0_CRYPTOACC_SHIFT        1                                         /**< Shift value for SMU_CRYPTOACC               */
#define _SMU_BMPUSATD0_CRYPTOACC_MASK         0x2UL                                     /**< Bit mask for SMU_CRYPTOACC                  */
#define _SMU_BMPUSATD0_CRYPTOACC_DEFAULT      0x00000001UL                              /**< Mode DEFAULT for SMU_BMPUSATD0              */
#define SMU_BMPUSATD0_CRYPTOACC_DEFAULT       (_SMU_BMPUSATD0_CRYPTOACC_DEFAULT << 1)   /**< Shifted mode DEFAULT for SMU_BMPUSATD0      */
#define SMU_BMPUSATD0_LDMA                    (0x1UL << 4)                              /**< MCU LDMA secure mode                        */
#define _SMU_BMPUSATD0_LDMA_SHIFT             4                                         /**< Shift value for SMU_LDMA                    */
#define _SMU_BMPUSATD0_LDMA_MASK              0x10UL                                    /**< Bit mask for SMU_LDMA                       */
#define _SMU_BMPUSATD0_LDMA_DEFAULT           0x00000001UL                              /**< Mode DEFAULT for SMU_BMPUSATD0              */
#define SMU_BMPUSATD0_LDMA_DEFAULT            (_SMU_BMPUSATD0_LDMA_DEFAULT << 4)        /**< Shifted mode DEFAULT for SMU_BMPUSATD0      */

/* Bit fields for SMU BMPUFS */
#define _SMU_BMPUFS_RESETVALUE                0x00000000UL                              /**< Default value for SMU_BMPUFS                */
#define _SMU_BMPUFS_MASK                      0x000000FFUL                              /**< Mask for SMU_BMPUFS                         */
#define _SMU_BMPUFS_BMPUFSMASTERID_SHIFT      0                                         /**< Shift value for SMU_BMPUFSMASTERID          */
#define _SMU_BMPUFS_BMPUFSMASTERID_MASK       0xFFUL                                    /**< Bit mask for SMU_BMPUFSMASTERID             */
#define _SMU_BMPUFS_BMPUFSMASTERID_DEFAULT    0x00000000UL                              /**< Mode DEFAULT for SMU_BMPUFS                 */
#define SMU_BMPUFS_BMPUFSMASTERID_DEFAULT     (_SMU_BMPUFS_BMPUFSMASTERID_DEFAULT << 0) /**< Shifted mode DEFAULT for SMU_BMPUFS         */

/* Bit fields for SMU BMPUFSADDR */
#define _SMU_BMPUFSADDR_RESETVALUE            0x00000000UL                              /**< Default value for SMU_BMPUFSADDR            */
#define _SMU_BMPUFSADDR_MASK                  0xFFFFFFFFUL                              /**< Mask for SMU_BMPUFSADDR                     */
#define _SMU_BMPUFSADDR_BMPUFSADDR_SHIFT      0                                         /**< Shift value for SMU_BMPUFSADDR              */
#define _SMU_BMPUFSADDR_BMPUFSADDR_MASK       0xFFFFFFFFUL                              /**< Bit mask for SMU_BMPUFSADDR                 */
#define _SMU_BMPUFSADDR_BMPUFSADDR_DEFAULT    0x00000000UL                              /**< Mode DEFAULT for SMU_BMPUFSADDR             */
#define SMU_BMPUFSADDR_BMPUFSADDR_DEFAULT     (_SMU_BMPUFSADDR_BMPUFSADDR_DEFAULT << 0) /**< Shifted mode DEFAULT for SMU_BMPUFSADDR     */

/* Bit fields for SMU ESAURTYPES0 */
#define _SMU_ESAURTYPES0_RESETVALUE           0x00000000UL                              /**< Default value for SMU_ESAURTYPES0           */
#define _SMU_ESAURTYPES0_MASK                 0x00001000UL                              /**< Mask for SMU_ESAURTYPES0                    */
#define SMU_ESAURTYPES0_ESAUR3NS              (0x1UL << 12)                             /**< Region 3 Non-Secure Type                    */
#define _SMU_ESAURTYPES0_ESAUR3NS_SHIFT       12                                        /**< Shift value for SMU_ESAUR3NS                */
#define _SMU_ESAURTYPES0_ESAUR3NS_MASK        0x1000UL                                  /**< Bit mask for SMU_ESAUR3NS                   */
#define _SMU_ESAURTYPES0_ESAUR3NS_DEFAULT     0x00000000UL                              /**< Mode DEFAULT for SMU_ESAURTYPES0            */
#define SMU_ESAURTYPES0_ESAUR3NS_DEFAULT      (_SMU_ESAURTYPES0_ESAUR3NS_DEFAULT << 12) /**< Shifted mode DEFAULT for SMU_ESAURTYPES0    */

/* Bit fields for SMU ESAURTYPES1 */
#define _SMU_ESAURTYPES1_RESETVALUE           0x00000000UL                               /**< Default value for SMU_ESAURTYPES1           */
#define _SMU_ESAURTYPES1_MASK                 0x00001000UL                               /**< Mask for SMU_ESAURTYPES1                    */
#define SMU_ESAURTYPES1_ESAUR11NS             (0x1UL << 12)                              /**< Region 11 Non-Secure Type                   */
#define _SMU_ESAURTYPES1_ESAUR11NS_SHIFT      12                                         /**< Shift value for SMU_ESAUR11NS               */
#define _SMU_ESAURTYPES1_ESAUR11NS_MASK       0x1000UL                                   /**< Bit mask for SMU_ESAUR11NS                  */
#define _SMU_ESAURTYPES1_ESAUR11NS_DEFAULT    0x00000000UL                               /**< Mode DEFAULT for SMU_ESAURTYPES1            */
#define SMU_ESAURTYPES1_ESAUR11NS_DEFAULT     (_SMU_ESAURTYPES1_ESAUR11NS_DEFAULT << 12) /**< Shifted mode DEFAULT for SMU_ESAURTYPES1    */

/* Bit fields for SMU ESAUMRB01 */
#define _SMU_ESAUMRB01_RESETVALUE             0x02000000UL                              /**< Default value for SMU_ESAUMRB01             */
#define _SMU_ESAUMRB01_MASK                   0x0FFFF000UL                              /**< Mask for SMU_ESAUMRB01                      */
#define _SMU_ESAUMRB01_ESAUMRB01_SHIFT        12                                        /**< Shift value for SMU_ESAUMRB01               */
#define _SMU_ESAUMRB01_ESAUMRB01_MASK         0xFFFF000UL                               /**< Bit mask for SMU_ESAUMRB01                  */
#define _SMU_ESAUMRB01_ESAUMRB01_DEFAULT      0x00002000UL                              /**< Mode DEFAULT for SMU_ESAUMRB01              */
#define SMU_ESAUMRB01_ESAUMRB01_DEFAULT       (_SMU_ESAUMRB01_ESAUMRB01_DEFAULT << 12)  /**< Shifted mode DEFAULT for SMU_ESAUMRB01      */

/* Bit fields for SMU ESAUMRB12 */
#define _SMU_ESAUMRB12_RESETVALUE             0x04000000UL                              /**< Default value for SMU_ESAUMRB12             */
#define _SMU_ESAUMRB12_MASK                   0x0FFFF000UL                              /**< Mask for SMU_ESAUMRB12                      */
#define _SMU_ESAUMRB12_ESAUMRB12_SHIFT        12                                        /**< Shift value for SMU_ESAUMRB12               */
#define _SMU_ESAUMRB12_ESAUMRB12_MASK         0xFFFF000UL                               /**< Bit mask for SMU_ESAUMRB12                  */
#define _SMU_ESAUMRB12_ESAUMRB12_DEFAULT      0x00004000UL                              /**< Mode DEFAULT for SMU_ESAUMRB12              */
#define SMU_ESAUMRB12_ESAUMRB12_DEFAULT       (_SMU_ESAUMRB12_ESAUMRB12_DEFAULT << 12)  /**< Shifted mode DEFAULT for SMU_ESAUMRB12      */

