espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFM32PG22/Include/efm32pg22_smu.h
/* Bit fields for SMU PPUNSPATD1 */
#define _SMU_PPUNSPATD1_RESETVALUE              0x00000000UL                              /**< Default value for SMU_PPUNSPATD1            */
#define _SMU_PPUNSPATD1_MASK                    0x0000FFFFUL                              /**< Mask for SMU_PPUNSPATD1                     */
#define SMU_PPUNSPATD1_DCDC                     (0x1UL << 1)                              /**< DCDC Privileged Access                      */
#define _SMU_PPUNSPATD1_DCDC_SHIFT              1                                         /**< Shift value for SMU_DCDC                    */
#define _SMU_PPUNSPATD1_DCDC_MASK               0x2UL                                     /**< Bit mask for SMU_DCDC                       */
#define _SMU_PPUNSPATD1_DCDC_DEFAULT            0x00000000UL                              /**< Mode DEFAULT for SMU_PPUNSPATD1             */
#define SMU_PPUNSPATD1_DCDC_DEFAULT             (_SMU_PPUNSPATD1_DCDC_DEFAULT << 1)       /**< Shifted mode DEFAULT for SMU_PPUNSPATD1     */
#define SMU_PPUNSPATD1_PDM                      (0x1UL << 2)                              /**< PDM Privileged Access                       */
#define _SMU_PPUNSPATD1_PDM_SHIFT               2                                         /**< Shift value for SMU_PDM                     */
#define _SMU_PPUNSPATD1_PDM_MASK                0x4UL                                     /**< Bit mask for SMU_PDM                        */
#define _SMU_PPUNSPATD1_PDM_DEFAULT             0x00000000UL                              /**< Mode DEFAULT for SMU_PPUNSPATD1             */
#define SMU_PPUNSPATD1_PDM_DEFAULT              (_SMU_PPUNSPATD1_PDM_DEFAULT << 2)        /**< Shifted mode DEFAULT for SMU_PPUNSPATD1     */
#define SMU_PPUNSPATD1_SMU                      (0x1UL << 5)                              /**< SMU Privileged Access                       */
#define _SMU_PPUNSPATD1_SMU_SHIFT               5                                         /**< Shift value for SMU_SMU                     */
#define _SMU_PPUNSPATD1_SMU_MASK                0x20UL                                    /**< Bit mask for SMU_SMU                        */
#define _SMU_PPUNSPATD1_SMU_DEFAULT             0x00000000UL                              /**< Mode DEFAULT for SMU_PPUNSPATD1             */
#define SMU_PPUNSPATD1_SMU_DEFAULT              (_SMU_PPUNSPATD1_SMU_DEFAULT << 5)        /**< Shifted mode DEFAULT for SMU_PPUNSPATD1     */
#define SMU_PPUNSPATD1_SMUCFGNS                 (0x1UL << 6)                              /**< SMUCFGNS Privileged Access                  */
#define _SMU_PPUNSPATD1_SMUCFGNS_SHIFT          6                                         /**< Shift value for SMU_SMUCFGNS                */
#define _SMU_PPUNSPATD1_SMUCFGNS_MASK           0x40UL                                    /**< Bit mask for SMU_SMUCFGNS                   */
#define _SMU_PPUNSPATD1_SMUCFGNS_DEFAULT        0x00000000UL                              /**< Mode DEFAULT for SMU_PPUNSPATD1             */
#define SMU_PPUNSPATD1_SMUCFGNS_DEFAULT         (_SMU_PPUNSPATD1_SMUCFGNS_DEFAULT << 6)   /**< Shifted mode DEFAULT for SMU_PPUNSPATD1     */
#define SMU_PPUNSPATD1_RTCC                     (0x1UL << 7)                              /**< RTCC Privileged Access                      */
#define _SMU_PPUNSPATD1_RTCC_SHIFT              7                                         /**< Shift value for SMU_RTCC                    */
#define _SMU_PPUNSPATD1_RTCC_MASK               0x80UL                                    /**< Bit mask for SMU_RTCC                       */
#define _SMU_PPUNSPATD1_RTCC_DEFAULT            0x00000000UL                              /**< Mode DEFAULT for SMU_PPUNSPATD1             */
#define SMU_PPUNSPATD1_RTCC_DEFAULT             (_SMU_PPUNSPATD1_RTCC_DEFAULT << 7)       /**< Shifted mode DEFAULT for SMU_PPUNSPATD1     */
#define SMU_PPUNSPATD1_LETIMER0                 (0x1UL << 8)                              /**< LETIMER0 Privileged Access                  */
#define _SMU_PPUNSPATD1_LETIMER0_SHIFT          8                                         /**< Shift value for SMU_LETIMER0                */
#define _SMU_PPUNSPATD1_LETIMER0_MASK           0x100UL                                   /**< Bit mask for SMU_LETIMER0                   */
#define _SMU_PPUNSPATD1_LETIMER0_DEFAULT        0x00000000UL                              /**< Mode DEFAULT for SMU_PPUNSPATD1             */
#define SMU_PPUNSPATD1_LETIMER0_DEFAULT         (_SMU_PPUNSPATD1_LETIMER0_DEFAULT << 8)   /**< Shifted mode DEFAULT for SMU_PPUNSPATD1     */
#define SMU_PPUNSPATD1_IADC0                    (0x1UL << 9)                              /**< IADC0 Privileged Access                     */
#define _SMU_PPUNSPATD1_IADC0_SHIFT             9                                         /**< Shift value for SMU_IADC0                   */
#define _SMU_PPUNSPATD1_IADC0_MASK              0x200UL                                   /**< Bit mask for SMU_IADC0                      */
#define _SMU_PPUNSPATD1_IADC0_DEFAULT           0x00000000UL                              /**< Mode DEFAULT for SMU_PPUNSPATD1             */
#define SMU_PPUNSPATD1_IADC0_DEFAULT            (_SMU_PPUNSPATD1_IADC0_DEFAULT << 9)      /**< Shifted mode DEFAULT for SMU_PPUNSPATD1     */
#define SMU_PPUNSPATD1_I2C0                     (0x1UL << 10)                             /**< I2C0 Privileged Access                      */
#define _SMU_PPUNSPATD1_I2C0_SHIFT              10                                        /**< Shift value for SMU_I2C0                    */
#define _SMU_PPUNSPATD1_I2C0_MASK               0x400UL                                   /**< Bit mask for SMU_I2C0                       */
#define _SMU_PPUNSPATD1_I2C0_DEFAULT            0x00000000UL                              /**< Mode DEFAULT for SMU_PPUNSPATD1             */
#define SMU_PPUNSPATD1_I2C0_DEFAULT             (_SMU_PPUNSPATD1_I2C0_DEFAULT << 10)      /**< Shifted mode DEFAULT for SMU_PPUNSPATD1     */
#define SMU_PPUNSPATD1_WDOG0                    (0x1UL << 11)                             /**< WDOG0 Privileged Access                     */
#define _SMU_PPUNSPATD1_WDOG0_SHIFT             11                                        /**< Shift value for SMU_WDOG0                   */
#define _SMU_PPUNSPATD1_WDOG0_MASK              0x800UL                                   /**< Bit mask for SMU_WDOG0                      */
#define _SMU_PPUNSPATD1_WDOG0_DEFAULT           0x00000000UL                              /**< Mode DEFAULT for SMU_PPUNSPATD1             */
#define SMU_PPUNSPATD1_WDOG0_DEFAULT            (_SMU_PPUNSPATD1_WDOG0_DEFAULT << 11)     /**< Shifted mode DEFAULT for SMU_PPUNSPATD1     */
#define SMU_PPUNSPATD1_AMUXCP0                  (0x1UL << 12)                             /**< AMUXCP0 Privileged Access                   */
#define _SMU_PPUNSPATD1_AMUXCP0_SHIFT           12                                        /**< Shift value for SMU_AMUXCP0                 */
#define _SMU_PPUNSPATD1_AMUXCP0_MASK            0x1000UL                                  /**< Bit mask for SMU_AMUXCP0                    */
#define _SMU_PPUNSPATD1_AMUXCP0_DEFAULT         0x00000000UL                              /**< Mode DEFAULT for SMU_PPUNSPATD1             */
#define SMU_PPUNSPATD1_AMUXCP0_DEFAULT          (_SMU_PPUNSPATD1_AMUXCP0_DEFAULT << 12)   /**< Shifted mode DEFAULT for SMU_PPUNSPATD1     */
#define SMU_PPUNSPATD1_EUART0                   (0x1UL << 13)                             /**< EUART0 Privileged Access                    */
#define _SMU_PPUNSPATD1_EUART0_SHIFT            13                                        /**< Shift value for SMU_EUART0                  */
#define _SMU_PPUNSPATD1_EUART0_MASK             0x2000UL                                  /**< Bit mask for SMU_EUART0                     */
#define _SMU_PPUNSPATD1_EUART0_DEFAULT          0x00000000UL                              /**< Mode DEFAULT for SMU_PPUNSPATD1             */
#define SMU_PPUNSPATD1_EUART0_DEFAULT           (_SMU_PPUNSPATD1_EUART0_DEFAULT << 13)    /**< Shifted mode DEFAULT for SMU_PPUNSPATD1     */
#define SMU_PPUNSPATD1_CRYPTOACC                (0x1UL << 14)                             /**< CRYPTOACC Privileged Access                 */
#define _SMU_PPUNSPATD1_CRYPTOACC_SHIFT         14                                        /**< Shift value for SMU_CRYPTOACC               */
#define _SMU_PPUNSPATD1_CRYPTOACC_MASK          0x4000UL                                  /**< Bit mask for SMU_CRYPTOACC                  */
#define _SMU_PPUNSPATD1_CRYPTOACC_DEFAULT       0x00000000UL                              /**< Mode DEFAULT for SMU_PPUNSPATD1             */
#define SMU_PPUNSPATD1_CRYPTOACC_DEFAULT        (_SMU_PPUNSPATD1_CRYPTOACC_DEFAULT << 14) /**< Shifted mode DEFAULT for SMU_PPUNSPATD1     */

