espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFM32PG22/Include/efm32pg22_smu.h
/* Bit fields for SMU PPUNSFS */
#define _SMU_PPUNSFS_RESETVALUE                 0x00000000UL                              /**< Default value for SMU_PPUNSFS               */
#define _SMU_PPUNSFS_MASK                       0x000000FFUL                              /**< Mask for SMU_PPUNSFS                        */
#define _SMU_PPUNSFS_PPUFSPERIPHID_SHIFT        0                                         /**< Shift value for SMU_PPUFSPERIPHID           */
#define _SMU_PPUNSFS_PPUFSPERIPHID_MASK         0xFFUL                                    /**< Bit mask for SMU_PPUFSPERIPHID              */
#define _SMU_PPUNSFS_PPUFSPERIPHID_DEFAULT      0x00000000UL                              /**< Mode DEFAULT for SMU_PPUNSFS                */
#define SMU_PPUNSFS_PPUFSPERIPHID_DEFAULT       (_SMU_PPUNSFS_PPUFSPERIPHID_DEFAULT << 0) /**< Shifted mode DEFAULT for SMU_PPUNSFS        */

/* Bit fields for SMU BMPUNSPATD0 */
#define _SMU_BMPUNSPATD0_RESETVALUE             0x00000000UL                              /**< Default value for SMU_BMPUNSPATD0           */
#define _SMU_BMPUNSPATD0_MASK                   0x0000001FUL                              /**< Mask for SMU_BMPUNSPATD0                    */
#define SMU_BMPUNSPATD0_CRYPTOACC               (0x1UL << 1)                              /**< CRYPTOACC DMA privileged mode               */
#define _SMU_BMPUNSPATD0_CRYPTOACC_SHIFT        1                                         /**< Shift value for SMU_CRYPTOACC               */
#define _SMU_BMPUNSPATD0_CRYPTOACC_MASK         0x2UL                                     /**< Bit mask for SMU_CRYPTOACC                  */
#define _SMU_BMPUNSPATD0_CRYPTOACC_DEFAULT      0x00000000UL                              /**< Mode DEFAULT for SMU_BMPUNSPATD0            */
#define SMU_BMPUNSPATD0_CRYPTOACC_DEFAULT       (_SMU_BMPUNSPATD0_CRYPTOACC_DEFAULT << 1) /**< Shifted mode DEFAULT for SMU_BMPUNSPATD0    */
#define SMU_BMPUNSPATD0_LDMA                    (0x1UL << 4)                              /**< MCU LDMA privileged mode                    */
#define _SMU_BMPUNSPATD0_LDMA_SHIFT             4                                         /**< Shift value for SMU_LDMA                    */
#define _SMU_BMPUNSPATD0_LDMA_MASK              0x10UL                                    /**< Bit mask for SMU_LDMA                       */
#define _SMU_BMPUNSPATD0_LDMA_DEFAULT           0x00000000UL                              /**< Mode DEFAULT for SMU_BMPUNSPATD0            */
#define SMU_BMPUNSPATD0_LDMA_DEFAULT            (_SMU_BMPUNSPATD0_LDMA_DEFAULT << 4)      /**< Shifted mode DEFAULT for SMU_BMPUNSPATD0    */

/** @} End of group EFM32PG22_SMU_CFGNS_BitFields */
/** @} End of group EFM32PG22_SMU_CFGNS */
/** @} End of group Parts */

#endif /* EFM32PG22_SMU_H */
